; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v12 ?v10)
             (pred_3 ?v8 ?v5)
             (pred_9 ?v12 ?v5)
             (pred_11 ?v11 ?v12 )
	     (pred_8 ?v12)
             (pred_7 ?v7)
             (pred_5 ?v8)
             (pred_10 ?v5)
             (pred_4 ?v12)
             (pred_12 ?v8)
             (pred_6 ?v12)
             (pred_2 ))



(:action op_1
:parameters (?v9 ?v2 ?v4 ?v3)
:precondition (and (pred_7 ?v9) (pred_7 ?v2) (pred_5 ?v4) (pred_10 ?v3)
          (pred_1 ?v9 ?v2) (pred_3 ?v4 ?v3)
                   (pred_9 ?v2 ?v3) (pred_8 ?v9) 
                   (pred_4 ?v2) (pred_12 ?v4))
:effect (and  (pred_6 ?v2) (not (pred_4 ?v2))))


(:action op_4
:parameters (?v9 ?v6)
:precondition (and (pred_7 ?v9) (pred_7 ?v6)
               (pred_8 ?v9) (pred_1 ?v9 ?v6) (pred_6 ?v6))
:effect (and (pred_8 ?v6) (not (pred_8 ?v9))))

(:action op_3
:parameters (?v9 ?v4)
:precondition (and (pred_7 ?v9) (pred_5 ?v4) 
                  (pred_8 ?v9) (pred_11 ?v4 ?v9) (pred_2 ))
:effect (and (pred_12 ?v4)
   (not (pred_11 ?v4 ?v9)) (not (pred_2 ))))


(:action op_2
:parameters (?v9 ?v13 ?v1)
:precondition (and (pred_7 ?v9) (pred_5 ?v13) (pred_5 ?v1)
                  (pred_8 ?v9) (pred_12 ?v1) (pred_11 ?v13 ?v9))
:effect (and (pred_12 ?v13) (pred_11 ?v1 ?v9)
        (not (pred_12 ?v1)) (not (pred_11 ?v13 ?v9))))

(:action op_5
:parameters (?v9 ?v4)
:precondition (and (pred_7 ?v9) (pred_5 ?v4) 
                  (pred_8 ?v9) (pred_12 ?v4))
:effect (and (pred_2 ) (pred_11 ?v4 ?v9) (not (pred_12 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_10 obj_02 obj_12 obj_07 obj_09 obj_04 obj_01 obj_20 obj_15 obj_17 obj_03 obj_13 obj_18 obj_08 obj_14
    obj_19 obj_11 obj_06
    obj_16 obj_21 obj_05
    )

    (:init
       (pred_2)

       (pred_7 obj_22)
       (pred_7 obj_10)
       (pred_7 obj_02)
       (pred_7 obj_12)
       (pred_7 obj_07)
       (pred_7 obj_09)
       (pred_7 obj_04)
       (pred_7 obj_01)
       (pred_7 obj_20)
       (pred_7 obj_15)
       (pred_7 obj_17)
       (pred_7 obj_03)
       (pred_7 obj_13)
       (pred_7 obj_18)
       (pred_7 obj_08)
       (pred_7 obj_14)
       (pred_10 obj_19)
       (pred_10 obj_11)
       (pred_10 obj_06)
       (pred_5 obj_16)
       (pred_5 obj_21)
       (pred_5 obj_05)

       (pred_1 obj_22 obj_07)
       (pred_1 obj_22 obj_10)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_10 obj_22)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_02 obj_12)
       (pred_1 obj_02 obj_10)
       (pred_1 obj_12 obj_01)
       (pred_1 obj_12 obj_02)
       (pred_1 obj_07 obj_20)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_07 obj_22)
       (pred_1 obj_09 obj_15)
       (pred_1 obj_09 obj_04)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_09 obj_07)
       (pred_1 obj_04 obj_17)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_04 obj_09)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_01 obj_12)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_20 obj_13)
       (pred_1 obj_20 obj_15)
       (pred_1 obj_20 obj_07)
       (pred_1 obj_15 obj_18)
       (pred_1 obj_15 obj_17)
       (pred_1 obj_15 obj_09)
       (pred_1 obj_15 obj_20)
       (pred_1 obj_17 obj_08)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_17 obj_04)
       (pred_1 obj_17 obj_15)
       (pred_1 obj_03 obj_14)
       (pred_1 obj_03 obj_01)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_13 obj_20)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_18 obj_15)
       (pred_1 obj_18 obj_13)
       (pred_1 obj_08 obj_14)
       (pred_1 obj_08 obj_17)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_14 obj_03)
       (pred_1 obj_14 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_17)
       (pred_4 obj_04)
       (pred_9  obj_03 obj_19)
       (pred_9  obj_17 obj_11)
       (pred_9  obj_04 obj_06)
       (pred_6 obj_22)
       (pred_6 obj_10)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_07)
       (pred_6 obj_09)
       (pred_6 obj_01)
       (pred_6 obj_20)
       (pred_6 obj_15)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_08)
       (pred_6 obj_14)

       (pred_3  obj_16 obj_19)
       (pred_3  obj_21 obj_11)
       (pred_3  obj_05 obj_06)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_21 obj_13)
       (pred_11 obj_05 obj_17)
       (pred_8 obj_02)
    )

    (:goal (and
       (pred_11 obj_16 obj_15)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_4 obj_02 obj_12)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_12)
   goals met: 0 of 1
2. (op_3 obj_12 obj_16)
   deleted: (pred_11 obj_16 obj_12) (pred_2)
   added: (pred_12 obj_16)
   goals met: 0 of 1
3. (op_4 obj_12 obj_02)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_02)
   goals met: 0 of 1
4. (op_4 obj_02 obj_10)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_10)
   goals met: 0 of 1
5. (op_4 obj_10 obj_22)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_22)
   goals met: 0 of 1
6. (op_4 obj_22 obj_07)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_07)
   goals met: 0 of 1
7. (op_4 obj_07 obj_20)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_20)
   goals met: 0 of 1
8. (op_4 obj_20 obj_15)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_15)
   goals met: 0 of 1
9. (op_5 obj_15 obj_16)
   deleted: (pred_12 obj_16)
   added: (pred_2) (pred_11 obj_16 obj_15)
   goals met: 1 of 1
